[
    {
        "ID": "0",
        "Poster": "https://m.media-amazon.com/images/M/MV5BYWRkZjJiODEtM2IwZi00ZjM1LWEyOTUtOThjMDk3YThjZDUzXkEyXkFqcGdeQXVyMTUzMTg2ODkz._V1_UY209_CR0,0,140,209_AL_.jpg",
        "Title": "The Idea of You",
        "Year": "2023",
        "Certificate": "R",
        "Duration (min)": "115",
        "Genre": "Comedy, Drama, Romance",
        "Rating": "6.4",
        "Metascore": "67",
        "Director": "Michael Showalter",
        "Cast": "Anne Hathaway, Nicholas Galitzine, Ella Rubin, Annie Mumolo",
        "Votes": "28,744",
        "Description": "Solène, a 40-year-old single mom, begins an unexpected romance with 24-year-old Hayes Campbell, the lead singer of August Moon, the hottest boy band on the planet.",
        "Review Count": "166",
        "Review Title": "Hypocrisy as an idea",
        "Review": "This film, as well as the reaction to it, is a wonderful example of modern hypocrisy:The story is about an adult woman who is attracted to a young guy, 16 years younger than her, young enough to be her son, whom she sees at his boys band concert, and from people reactions starts from the movie trailer and beyond, we get praise and stories that this is the destruction of the stigma about the happiness of a woman at 40, that she can remain attractive at any age to any man, that happiness is available to anyone and it's not for us to judge someone else's love.But if this were a story about a man who, at the age of 40, attracted to a girl from a girls band, and the girl is 16 years younger than him, we would get stories about a disgusting creep who finds no other way to overcome his midlife crisis than preadatory pursue a girl, young enough to be his daughter."
    },
    {
        "ID": "1",
        "Poster": "https://m.media-amazon.com/images/M/MV5BZGI4NTEwNTAtZDcwMi00MDkxLTg1OGYtNTZmMzE3ZDljNzVlXkEyXkFqcGdeQXVyMTEyMjM2NDc2._V1_UY209_CR0,0,140,209_AL_.jpg",
        "Title": "Kingdom of the Planet of the Apes",
        "Year": "2023",
        "Certificate": "PG-13",
        "Duration (min)": "145",
        "Genre": "Action, Adventure, Sci-Fi",
        "Rating": "7.3",
        "Metascore": "66",
        "Director": "Wes Ball",
        "Cast": "Owen Teague, Freya Allan, Kevin Durand, Peter Macon",
        "Votes": "22,248",
        "Description": "Many years after the reign of Caesar, a young ape goes on a journey that will lead him to question everything he's been taught about the past and make choices that will define a future for apes and humans alike.",
        "Review Count": "183",
        "Review Title": "A phenomenal start to another trilogy!",
        "Review": "I'm a big fan of all the planet of the apes, and they nailed this one. Usually when they start milking series like this, they come out bad, but with the amazing cinematography and great acting, it more than succeeded. Some movies just deserve to be watched on a big screen, and this is one of them. The movie had me intrigued, and interested in the storyline unlike a lot of other movies I've seen this year. I'm looking forward to what they will come up with after this, and I can assure you that I will be watching no matter what. Go grab a popcorn and enjoy the phenomenal graphics this movies has to offer! Godspeed."
    },
    {
        "ID": "2",
        "Poster": "https://m.media-amazon.com/images/M/MV5BZjIyOTBmNzEtY2YxNC00YzgyLTgxZGYtOWM4NTYwNmZkNzA1XkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_UY209_CR0,0,140,209_AL_.jpg",
        "Title": "Unfrosted",
        "Year": "2023",
        "Certificate": "PG-13",
        "Duration (min)": "97",
        "Genre": "Biography, Comedy, History",
        "Rating": "5.5",
        "Metascore": "42",
        "Director": "Jerry Seinfeld",
        "Cast": "Isaac Bae, Jerry Seinfeld, Chris Rickett, Rachael Harris",
        "Votes": "18,401",
        "Description": "In 1963 Michigan, business rivals Kellogg's and Post compete to create a cake that could change breakfast forever.",
        "Review Count": "333",
        "Review Title": "not funny",
        "Review": "Pretty much the worst criticism you can lay on to a comedian but it is true. The movie has a satirical premise with lots of comedian cameos and a loosely reality based success story of the kelloggs staple procuct pop tarts. The story or premise are never the focal point, just elements to start sketch like scenes with over the top acting and comedic lines. The sketches however are never very funny, the few celebrity cameos kind of fall flat and the overthetopness never reaches absurdities warranting so bad that its good status. I was not expecting a bee movie type landing on your feet happenstance but i was hoping for it after the trailer made it look like there was quality comedy involved yet the movie started out weak. But no real saving grace to be found here. Just very mediocre, very flat and unfunny."
    },
    {
        "ID": "3",
        "Poster": "https://m.media-amazon.com/images/M/MV5BMjA5ZjA3ZjMtMzg2ZC00ZDc4LTk3MTctYTE1ZTUzZDIzMjQyXkEyXkFqcGdeQXVyMTM1NjM2ODg1._V1_UX140_CR0,0,140,209_AL_.jpg",
        "Title": "The Fall Guy",
        "Year": "2023",
        "Certificate": "PG-13",
        "Duration (min)": "126",
        "Genre": "Action, Comedy, Drama",
        "Rating": "7.3",
        "Metascore": "73",
        "Director": "David Leitch",
        "Cast": "Ryan Gosling, Emily Blunt, Aaron Taylor-Johnson, Hannah Waddingham",
        "Votes": "38,953",
        "Description": "A down-and-out stuntman must find the missing star of his ex-girlfriend's blockbuster film.",
        "Review Count": "384",
        "Review Title": "Everything you needed and more!",
        "Review": "Just got out of the Austin premier at SXSW and the whole theatre went nuts for the movie! Emily and Ryan have crazy chemistry and obviously a freaking amazing time shooting this. What a ton of fun!! Its packed with incredible stunts - none of them CGI, its funny and charming and exciting in every second. The camera work is flawless, the cinematography beautiful, the casting perfect, the costumes cool af, they have a DOG!! As a fan of the original series, I loved the movie for its celebration of stund craft and its people. Its a beautiful reminiscence to the original. Defo watching it again when it officially launches. God, I love Ryan and Emily. And thank you so much, David Leitch for making this happen. Seriously. Whatever you touch is incredibly fun to watch. Cant wait for the next one!!!!"
    },
    {
        "ID": "4",
        "Poster": "https://m.media-amazon.com/images/M/MV5BNTk1MTdmYzctNzlkOS00ZTNmLWI4ZTMtMzc3OWFkMDI0MTJkXkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_UY209_CR0,0,140,209_AL_.jpg",
        "Title": "Challengers",
        "Year": "2023",
        "Certificate": "R",
        "Duration (min)": "131",
        "Genre": "Drama, Romance, Sport",
        "Rating": "7.7",
        "Metascore": "82",
        "Director": "Luca Guadagnino",
        "Cast": "Zendaya, Mike Faist, Josh O'Connor, Darnell Appling",
        "Votes": "32,517",
        "Description": "Tashi, a former tennis prodigy turned coach, turned her husband into a champion. But to overcome a losing streak, he needs to face his ex-best friend and Tashi's ex-boyfriend.",
        "Review Count": "194",
        "Review Title": "Watch \"Match Point\" instead",
        "Review": "This is a tough one. I liked the concept and the overall story. However i feel like it missed the mark on occasions.The acting was decent. Felt like each character was built upon chemistry and realism. It kept me entertained for the most part.The times jumps at the beginning worked and created suspense. Leaving the viewer unsure of what the history our 3 characters share however, the time jumps became a bit too rapid and i personally found it harder to keep up with where we are in the story. I feel like they could've left out a few scenes to make the story flow smoother.The soundtrack was interesting. Not sure if it suited the mood of the film. But my biggest gripe is the ridiculously slowed down ending. Not sure what the director was thinking with that one.The conclusion felt like it was going on for 1 hour and i felt it a little cheesy with the last scene of the film.Overall I see a lot of influence from the film \"Match Point\" starring Scarlet Johansson. In my opinion that film was far more successful in what \"challengers\" was attempting.Overall, bit hit and miss. Some decent moments but nothing to get you excited about or talk about after."
    },
    {
        "ID": "5",
        "Poster": "https://m.media-amazon.com/images/M/MV5BY2JlYjlkNzMtNTU3OS00NDVmLTk4NTYtYTM4ZTEwMGM4NDBiXkEyXkFqcGdeQXVyMTUzMTg2ODkz._V1_UX140_CR0,0,140,209_AL_.jpg",
        "Title": "Abigail",
        "Year": "2023",
        "Certificate": "R",
        "Duration (min)": "109",
        "Genre": "Horror, Thriller",
        "Rating": "6.8",
        "Metascore": "62",
        "Director": "Matt Bettinelli-Olpin",
        "Cast": "Tyler Gillett, Melissa Barrera, Dan Stevens, Alisha Weir, William Catlett",
        "Votes": "27,284",
        "Description": "After a group of criminals kidnap the ballerina daughter of a powerful underworld figure, they retreat to an isolated mansion, unaware that they're locked inside with no normal little girl.",
        "Review Count": "168",
        "Review Title": "Underwhelming and Unimpressive",
        "Review": "Everything in this movie is mediocre except the cinematography and the production design. I was looking forward to this due to me really liking Radio Silence's 'Ready or Not'. I was hoping for a fun horror comedy akin to that, but 'Abigail' ended up being as frustrating and obnoxious as their 2 'Scream' movies. It was however, better than 'Scream 5', but that's not saying much.The acting all round is pretty bad. Dan Stevens is hamming it up, Melissa Barrera is a blank slate, but the worst performance by a mile is from Kathryne Newtown. Newtown has been bad in everything I've seen her in ('Detective Pikachu', the 'Death Note' remake), but here she's impressively awful, she can't even scream convincingly. The little girl is good for a child actress, but her dialogue is embarrassing lazy and stilted. She's the exact same kind of \"toying with her victims\" villain we've seen a million times before, now just in child form.There are TWO 3-minute exposition scenes in this movie where a character just stops the film dead in its tracks, and explains everyone's backstory. It wouldn't be as unbearable if these characters weren't stock and unlikeable, but not one of them has an interesting backstory, so wasting this time trying to \"flesh them out\" ends up being a complete, cliched waste. Theres even a gag where the big \"muscle\" character screams like a little girl, as if we haven't seen that joke a million times before...There were no engaging twists or revelations, and the characters were impossibly stupid. Unlike 'Ready or Not', where the lead character makes smart decisions, and the villains only make idiotic decisions because that's core to their character, the group in 'Abigail' are \"professionals\" who only make moronic decisions to further the contrived plot.One aspect that surprised me was how many loud and amateur jump-scares there were. None of them were effective, and the editing is akin to something you'd expect from a horror short on YouTube. The sound design is particularly egregious and insistent, and all but one of the needle drops are total cringe. There's no moments of tension or thrill. I doubt even a 12 year old would find any of this scary.It even uses the same exploding-bodies trick from 'Ready or Not', but in a much dumber and unsatisfying way. It even ends in the same way, with one character saying pretty much the exact same thing as Samara Weaving in 'Ready or Not'. It's just them playing the hits from their one good movie. There's not an original bone in this movie, despite it clearly insisting that it's some fresh, slick new take on vampires.I've seen a lot of stuff these two directors have done, including their sections in 'Southbound' and 'V/H/S', and it's clear that Gillet and Bettinelli-Olpin only have one good movie in them, and that's mostly due to the fact that the premise in 'Ready or Not' is really hard to screw up. I don't ask for much, I've seen tonnes of tiny budget, straight-to-streaming comedy horrors that are far more inventive, funny and transgressive than this forgettable chore."
    },
    {
        "ID": "6",
        "Poster": "https://m.media-amazon.com/images/M/MV5BYTYyODhlODktYjUzNC00NjUyLWI1MzYtNmI0MTY3YTUxYjY2XkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_UY209_CR0,0,140,209_AL_.jpg",
        "Title": "Civil War",
        "Year": "2023",
        "Certificate": "R",
        "Duration (min)": "109",
        "Genre": "Action, Adventure, Thriller",
        "Rating": "7.5",
        "Metascore": "75",
        "Director": "Alex Garland",
        "Cast": "Kirsten Dunst, Wagner Moura, Cailee Spaeny, Nick Offerman",
        "Votes": "64,014",
        "Description": "A journey across a dystopian future America, following a team of military-embedded journalists as they race against time to reach DC before rebel factions descend upon the White House.",
        "Review Count": "610",
        "Review Title": "Meander: The Movie",
        "Review": "I am huge fan of writer/director Alex Garland. I've loved his movies all the way back to 28 Days Later and Sunshine. His last movie, Men, was highly ambitious and memorable but didn't work for me. It was his first miss. Civil War is his second, but for very different reasons.Rather than being ambitious and memorable, Civil War is so normal and bland. I felt bored for the entire runtime, even the action scenes. Why? Because this movie doesn't have a story. It has a premise and does the bare minimum with that premise.The entire plot, which we find out at the beginning, is traveling from point A to point B. And it's dangerous. That's it. That's the whole purpose of the movie. It's also the purpose of a random episode of The Walking Dead. Or The Last of Us.The characters meander. The story meanders. The movie meanders. That's what I just spent two hours watching. A bunch of meandering. And you can throw in some well-shot action sequences. But I just didn't care. I was literally thinking to myself during the climax, \"I don't care.\"It reminded me of another movie that had so much hype and was a huge letdown. Battle Los Angeles was about an alien invasion. Yet the entire focus was a mission to rescue a group of civilians. It's a very regular story with a sci-fi skin on it. Civil War is a very regular story with dystopian skin.Look, this isn't a poor-quality movie. It just has no substance. It feels like nothing. And I had a terrible time watching it.(1 viewing, early access screening IMAX 4/8/2024)"
    },
    {
        "ID": "7",
        "Poster": "https://m.media-amazon.com/images/M/MV5BZTc3YmEwYTgtM2E1YS00NGQ1LTg1NzYtNTMxMzA5ODFhZThhXkEyXkFqcGdeQXVyNzAwMjU2MTY@._V1_UX140_CR0,0,140,209_AL_.jpg",
        "Title": "Twisters",
        "Year": "2023",
        "Certificate": "",
        "Duration (min)": "",
        "Genre": "Action, Adventure, Thriller",
        "Rating": "",
        "Metascore": "",
        "Director": "Lee Isaac Chung",
        "Cast": "Daisy Edgar-Jones, Glen Powell, David Corenswet, Katy O'Brian",
        "Votes": "",
        "Description": "An update to the 1996 film 'Twister', which centered on a pair of storm chasers who risk their lives in an attempt to test an experimental weather alert system.",
        "Review Count": "0",
        "Review Title": "",
        "Review": ""
    },
    {
        "ID": "8",
        "Poster": "https://m.media-amazon.com/images/M/MV5BOTVhZGU2OWQtNDM1Ni00MzM3LTgzYjgtOTEwYzQzOWZjNTIyXkEyXkFqcGdeQXVyMTcwOTQzOTYy._V1_UY209_CR0,0,140,209_AL_.jpg",
        "Title": "Anyone But You",
        "Year": "2023",
        "Certificate": "R",
        "Duration (min)": "103",
        "Genre": "Comedy, Romance",
        "Rating": "6.1",
        "Metascore": "52",
        "Director": "Will Gluck",
        "Cast": "Sydney Sweeney, Glen Powell, Alexandra Shipp, Mia Artemis",
        "Votes": "82,215",
        "Description": "After an amazing first date, Bea and Ben's fiery attraction turns ice-cold--until they find themselves unexpectedly reunited at a wedding in Australia. So they do what any two mature adults would do: pretend to be a couple.",
        "Review Count": "373",
        "Review Title": "Pure escapism featuring beautiful people, beautiful locations with lots of laugh out loud moments",
        "Review": "This was like an R rated raunchy Hallmark movie where people actually have sex. I can do without the miscommunication trope that drove apart a couple that seemed to be connecting, but I enjoyed the banter and really enjoyed the stars.\"Serious\" critics typically don't appreciate the rom-com genre and judge them harshly. I went with my adult children and we all loved the movie. My kids make fun of my love for Hallmark movies, but even they liked this one. We laughed out loud repeatedly and walked out smiling. I love that feeling.Sure, the script is flawed, the plot's ridiculous, and some of the dialogue is a bit off, but Glen Powell and Sydney Sweeney light up the screen with their amazing chemistry. They're extraordinary specimens and look like they spend 6 hours a day in the gym, but I also like them as actors. Glen Powell was really good in another enjoyable modern rom-com with Zoey Deutch called \"Set It Up\" and he's fearless here, especially with the over the top body humor.Sydney Sweeney is certainly voluptuous, and gorgeous to look at, but she's also established herself as a great actress in more critic friendly shows like \"Euphoria\" and \"White Lotus\". Edgy and dark is fine, and it certainly gets taken more seriously by the critics, but I prefer getting lost in an escapist rom-com that doesn't involve terrible people doing terrible things.I want more of this."
    },
    {
        "ID": "9",
        "Poster": "https://m.media-amazon.com/images/M/MV5BOWI5YTlkNTktOTJlMC00MmYyLThkNzQtYmExOGZkZDE1ZjgwXkEyXkFqcGdeQXVyMjM4NTM5NDY@._V1_UY209_CR0,0,140,209_AL_.jpg",
        "Title": "The Ministry of Ungentlemanly Warfare",
        "Year": "2023",
        "Certificate": "R",
        "Duration (min)": "120",
        "Genre": "Action, Drama, War",
        "Rating": "7",
        "Metascore": "57",
        "Director": "Guy Ritchie",
        "Cast": "Henry Cavill, Alan Ritchson, Alex Pettyfer, Eiza González",
        "Votes": "21,084",
        "Description": "The British military recruits a small group of highly skilled soldiers to strike against German forces behind enemy lines during World War II.",
        "Review Count": "117",
        "Review Title": "Fun Movie, fun cast!",
        "Review": "As a fan of both Henry Cavill and Guy Ritchie, I was thrilled to find an early access showing of this movie at a nearby theater.Ungentlemanly Warfare looked to be a good time, and indeed it is! It's a neat story and they made the telling of it fun. Thankfully it isn't goofy. It's not nonstop jokes, but it has a good sense of humor and I heard a good bit of chuckling in the theater throughout the movie, much of it coming from myself.You can tell Cavill had fun with this role. He shows off some range as his character is very different from the brooding muscle man that many people associate him with. It was delightful watching him do comedy. I haven't seen much of Alan Ritchson's work, but it was easy to see why he has such a growing fanbase. He's the muscle in this movie and proves to be a great action star. The whole cast is great and they give us a lot of fun characters.Action-comedies seem to be Guy Ritchie's specialty. He maintains a good balance of action and comedy and works so well with large casts as he lets every character feel like they matter to the story."
    },
    {
        "ID": "10",
        "Poster": "https://m.media-amazon.com/images/M/MV5BN2QyZGU4ZDctOWMzMy00NTc5LThlOGQtODhmNDI1NmY5YzAwXkEyXkFqcGdeQXVyMDM2NDM2MQ@@._V1_UY209_CR0,0,140,209_AL_.jpg",
        "Title": "Dune: Part Two",
        "Year": "2023",
        "Certificate": "PG-13",
        "Duration (min)": "166",
        "Genre": "Action, Adventure, Drama",
        "Rating": "8.7",
        "Metascore": "79",
        "Director": "Denis Villeneuve",
        "Cast": "Timothée Chalamet, Zendaya, Rebecca Ferguson, Javier Bardem",
        "Votes": "401,659",
        "Description": "Paul Atreides unites with Chani and the Fremen while seeking revenge against the conspirators who destroyed his family.",
        "Review Count": "1,741",
        "Review Title": "Ladies and gentleman.. the PEAK of filmmaking!!",
        "Review": "This is the kind of movie that is impossible to do justice, just by talking about it! It is the kind of experience you had once.. but you never thought you would get again.. until this movie proves you WRONG!!This movie takes the aspects of the first movie and improves upon them in almost every way possible, already writing itself into the books of greatest sequels of ALL TIME!!Everything in this movie was TOP notch! Dennis Villeneauve proves why he is not only a master of Sci-Fi movies, but just filmmaking in general! This was a demonstration of power, in what you can achieve with filmmaking!I beg you to watch this on the biggest and best screen you can find! This will be an experience that will stick with you forever!I thought the real Blockbuster was dead.. but I was wrong! This is the cinematic experience i craved!Now I am gonna watch this movie again, and maybe again! Then I am gonna read the books!"
    },
    {
        "ID": "11",
        "Poster": "https://m.media-amazon.com/images/M/MV5BNmYzMWVjNmQtNjJjNy00M2Y4LTkzZjQtZWQ5NmYzMjRjMDIzXkEyXkFqcGdeQXVyMTM1NjM2ODg1._V1_UY209_CR13,0,140,209_AL_.jpg",
        "Title": "Furiosa: A Mad Max Saga",
        "Year": "2023",
        "Certificate": "R",
        "Duration (min)": "148",
        "Genre": "Action, Adventure, Sci-Fi",
        "Rating": "8.3",
        "Metascore": "83",
        "Director": "George Miller",
        "Cast": "Anya Taylor-Joy, Chris Hemsworth, Charlee Fraser, Lachy Hulme",
        "Votes": "259",
        "Description": "The origin story of renegade warrior Furiosa before her encounter and teamup with Mad Max.",
        "Review Count": "3",
        "Review Title": "Being vastly overrated at this point",
        "Review": "I had the wonderful opportunity to see this movie so I'm a little puzzled by the extreme praise it's getting. It's quite episodic in a strange way for the series as well as feeling more oddly polished. In addition it really adds nothing to the character or world that is worth knowing.Outside of the slim and pointless story, Anya Taylor Joy is exceptionally weak casting and while she certainly makes an effort, doesn't come off as hard enough for this type of character (even in the quasi fantasy setting of Mad Max) at all.I do wonder if the fact this is starring Taylor Joy and is a story of empowerment is what's causing the high reviews? I find it difficult to believe a similar unnecessary story lacking the bite of all others in the franchise about such a limply cast male character would garner such reviews.Honestly 3 stars is about right for the movie. It's slim on everything."
    },
    {
        "ID": "12",
        "Poster": "https://m.media-amazon.com/images/M/MV5BOTI5MjNjMTMtN2NiNC00YjBlLTgzMWQtMGRhZDZkYmY1NGU2XkEyXkFqcGdeQXVyNTgyNTA4MjM@._V1_UY209_CR0,0,140,209_AL_.jpg",
        "Title": "Gojira -1.0",
        "Year": "2023",
        "Certificate": "PG-13",
        "Duration (min)": "124",
        "Genre": "Action, Adventure, Drama",
        "Rating": "8",
        "Metascore": "81",
        "Director": "Takashi Yamazaki",
        "Cast": "Minami Hamabe, Ryunosuke Kamiki, Sakura Andô, Rikako Miura",
        "Votes": "71,109",
        "Description": "Post war Japan is at its lowest point when a new crisis emerges in the form of a giant monster, baptized in the horrific power of the atomic bomb.",
        "Review Count": "526",
        "Review Title": "Maybe the best Godzilla movie since the original",
        "Review": "I'm a huge fan of Godzilla, I think the original from 1954 is a genuine classic and a great film (not just a great \"monster\" movie). The Heisei era is my overall favorite, and I thought Shin Godzilla was weird in all the right ways. It was one of my favorite movies from that year.This one might be even better. You actually care about the characters. It deals with some very serious topics, such as survivors guilt and the aftermath of war violence on civilians and conflicting emotions around national pride and feeling betrayed by your government. Yet the film is also exciting and optimistic and has some of the best Godzilla sequences ever put to screen. My favorite depiction of Godzilla is as a force of nature, representing the power of the atomic bomb or the fury of war itself. That's the Godzilla you get here. I think this film can very favorably be compared to American classics like Jaws and Jurassic Park, too.I don't want to say too much, it's best to just experience the movie for yourself. The only part that felt a little false to me was the very end, but I understand why the director wanted to do it that way. The special effects look great for the most part, but there are a couple of shots here and there that aren't perfect when compared to some Hollywood movies. However, it hardly matters. This is an incredible film.9/10 easily, probably closer to 9.5My current Godzilla rankings:1) Gojira (1954)\n2) Godzilla Minus One (2023)\n3) Godzilla vs. Destoroyah (1995)\n4) Shin Godzilla (2016)\n5) Return of Godzilla (1984)Special mentions to GMK, Godzilla vs. Biollante, Godzilla vs. Mechagodzilla (1974) and Mothra vs. Godzilla (1964)"
    },
    {
        "ID": "13",
        "Poster": "https://m.media-amazon.com/images/M/MV5BNGE5MWJmZWYtN2ZlMi00ZjY1LTlhYTUtMzQ2Y2IxZWQyYTA2XkEyXkFqcGdeQXVyMTUzMTg2ODkz._V1_UY209_CR0,0,140,209_AL_.jpg",
        "Title": "Ghostbusters: Frozen Empire",
        "Year": "2023",
        "Certificate": "PG-13",
        "Duration (min)": "115",
        "Genre": "Adventure, Comedy, Fantasy",
        "Rating": "6.2",
        "Metascore": "46",
        "Director": "Gil Kenan",
        "Cast": "Paul Rudd, Carrie Coon, Finn Wolfhard, Mckenna Grace",
        "Votes": "39,558",
        "Description": "When the discovery of an ancient artifact unleashes an evil force, Ghostbusters new and old must join forces to protect their home and save the world from a second ice age.",
        "Review Count": "403",
        "Review Title": "Loved it",
        "Review": "If you want to hate this movie, or nit pick everything, you can. I am a big Ghostbusters fan, but my family are casual fans and we all loved Frozen Empire. It's fun, funny, at times scary and just a joy to watch. It's great seeing their world expanded. You get so much more lore, and new stuff added that would fit right along with themes from Real Ghostbusters. I can't even really fathom why this is getting negative reactions. I guess post COVID movies aren't supposed to be fun and take the audience on a ride anymore. There's a lot to love here, die hard or casual fans, and it's worth your money to see it on the big screen. A worthy sequel and I hope we get more."
    },
    {
        "ID": "14",
        "Poster": "https://m.media-amazon.com/images/M/MV5BZTA1Y2Q0N2QtNjU2Yi00MTMxLWI4NmUtMWFjNzRkNzU1ODRhXkEyXkFqcGdeQXVyMTY3ODkyNDkz._V1_UX140_CR0,0,140,209_AL_.jpg",
        "Title": "Love Lies Bleeding",
        "Year": "2023",
        "Certificate": "R",
        "Duration (min)": "104",
        "Genre": "Action, Adventure, Crime",
        "Rating": "6.8",
        "Metascore": "77",
        "Director": "Rose Glass",
        "Cast": "Anna Baryshnikov, Kristen Stewart, Dave Franco, Katy O'Brian",
        "Votes": "20,636",
        "Description": "Gym manager Lou falls for Jackie, a bodybuilder who is passing through town en route to a competition in Las Vegas.",
        "Review Count": "95",
        "Review Title": "Refreshing take on action thriller",
        "Review": "Fantastic movie, great cast. Actors delivered. I left the film asking myself, \"is this a new story or have we just ignored queer stories for so long?\" I was thrilled to see a movie centered on queer love without the typical tropes of people caring whether the town or family accepted their sexuality. I found myself covering my eyes more than Saltburn at the gore, twists, and energizing perspective on FEMALE POWER. This movie is purposeful in its dialogue and shots. Jam packed with addiction, obsession, and most intriguing, hope. Grab some popcorn, enjoy the desert starry sky and go watch this film!"
    },
    {
        "ID": "15",
        "Poster": "https://m.media-amazon.com/images/M/MV5BMTcyNzIxOTIwMV5BMl5BanBnXkFtZTgwMzE0NjQwMjE@._V1_UX140_CR0,0,140,209_AL_.jpg",
        "Title": "The Judge",
        "Year": "2023",
        "Certificate": "A",
        "Duration (min)": "141",
        "Genre": "Crime, Drama, Mystery",
        "Rating": "7.4",
        "Metascore": "48",
        "Director": "David Dobkin",
        "Cast": "Robert Downey Jr., Robert Duvall, Vera Farmiga, Billy Bob Thornton",
        "Votes": "204,222",
        "Description": "Big-city lawyer Hank Palmer returns to his childhood home where his father, the town's judge, is suspected of murder. Hank sets out to discover the truth; along the way he reconnects with his estranged family.",
        "Review Count": "338",
        "Review Title": "Beautiful and Deeply Touching",
        "Review": "I don't usually write a review, but I feel compelled to defend this film against critics who, I feel, have unfairly given it a low rating. While its premise is not necessarily unique and it has its fair share of clichés, The Judge is a deeply moving film that showcases the acting powerhouse that is Robert Duvall and the undeniable versatility and magnetic screen presence of Robert Downey Jr. There are also strong supporting performances from Vera Farmiga (she and RJD have great chemistry), Billy Bob Thornton, Vincent D'Onofrio, and Jeremy Strong. I dare anyone who has dealt with family issues not to be affected. Forget the critics - they don't know everything - and do yourself a favour and watch The Judge. You won't regret it."
    },
    {
        "ID": "16",
        "Poster": "https://m.media-amazon.com/images/M/MV5BZWIzN2FhN2ItNTYxMC00M2Q3LThiNGMtOWRjYjE5MDY4MjFiXkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_UY209_CR0,0,140,209_AL_.jpg",
        "Title": "Mother of the Bride",
        "Year": "2023",
        "Certificate": "",
        "Duration (min)": "88",
        "Genre": "Comedy, Drama, Romance",
        "Rating": "4.9",
        "Metascore": "39",
        "Director": "Mark Waters",
        "Cast": "Brooke Shields, Miranda Cosgrove, Benjamin Bratt, Rachael Harris",
        "Votes": "5,081",
        "Description": "Lana's daughter Emma returns from London and announces that she's getting married next month. Things become more complicated when Lana learns that the man who stole Emma's heart is the son of the man who broke hers years ago.",
        "Review Count": "70",
        "Review Title": "Poor acting",
        "Review": "I knew it was a predictable movie, but the script and the acting is so bad executed that it becomes impossible to buy the story. There isn't chemistry among the actors. The bride and the groom seems like friends or strangers, and the relationship between Brooke Shields and her romantic interest doesn't work at all.Everything fells like a bunch of prefabricated scenes glue together with poor edition. In my opinion this is the problem of Netflix, they don't wanna take risks. Just go for familiar faces with terrible scripts and poor acting. It could be a nice return for Brooke Shields, but it was disappointing to me."
    },
    {
        "ID": "17",
        "Poster": "https://m.media-amazon.com/images/M/MV5BYWQ4OGI2MmQtZjUxMC00Njg2LWJiZTQtYmFmZjI5ZmI1Y2U1XkEyXkFqcGdeQXVyMTA1NjE5MTAz._V1_UY209_CR1,0,140,209_AL_.jpg",
        "Title": "IF",
        "Year": "2023",
        "Certificate": "PG",
        "Duration (min)": "104",
        "Genre": "Animation, Comedy, Drama",
        "Rating": "6.8",
        "Metascore": "",
        "Director": "John Krasinski",
        "Cast": "Cailey Fleming, Ryan Reynolds, John Krasinski, Phoebe Waller-Bridge",
        "Votes": "906",
        "Description": "A young girl who goes through a difficult experience begins to see everyone's imaginary friends who have been left behind as their real-life friends have grown up.",
        "Review Count": "15",
        "Review Title": "30 year old male perspective",
        "Review": "I must admit, the first half hour had me questioning if I was wasting my time. I was confused about the vast demographics the film was trying to appeal to. Maybe there could've been some improvements there.Once the 2nd act started, I slowly started to find myself more and more invested in the characters. However, I was still questioning potential plot holes in the story and the films demographic.During the 3rd act, it really tied itself together and started to make a lot more sense. I want to rewatch it knowing how well it ends, similar to a Christopher Nolan film. I'm curious what a child would think of this film because it deals with some adult themes and subject matter that only an adult would relate to. It isn't crude, it's very family friendly. A child might find it slow and boring at times. The moral of the film might go over a child's head but there's plenty of humour and subject matter aimed at children.Overall, I was very impressed with this film, and I'll be watching it again. Take your kids to it. If they don't enjoy it now, it'll definitely have a completely different meaning to them in 10, 20, or 30 years. As an adult, you'll almost definitely enjoy it."
    },
    {
        "ID": "18",
        "Poster": "https://m.media-amazon.com/images/M/MV5BZTQyZWIwMTctNmM3Yy00YzhjLWFjYjgtNTdmZGE0OTBhM2Q3XkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_UY209_CR0,0,140,209_AL_.jpg",
        "Title": "Megalopolis",
        "Year": "2023",
        "Certificate": "",
        "Duration (min)": "133",
        "Genre": "Drama, Sci-Fi",
        "Rating": "",
        "Metascore": "",
        "Director": "Francis Ford Coppola",
        "Cast": "Nathalie Emmanuel, Shia LaBeouf, Giancarlo Esposito, Adam Driver",
        "Votes": "",
        "Description": "An architect wants to rebuild New York City as a utopia following a devastating disaster.",
        "Review Count": "1",
        "Review Title": "You should refuse this offer.",
        "Review": "FFC is an egomaniac to the force he spent his own personal millions to make this jumble of a film. I got to screen it and I am still trying to process it. It's like 1/4 of four different films rolled into one. The all star cast does the film no favors. Sadly, Adam Driver is a tortured soul and barely delivers. Shia LeBouf character is refreshing only in the sense he is a very good actor. Otherwise the ponytailed guy in pleather is annoying to the third degree. I am still trying to process what the point of the film and ending was. I won't spoil anything but it seems like its FFC attempt to sum up his movie career in some grandiose film. It's all very confusing and the run time consumes you. I had to pause it and come back 3 different times. Did he find a distributor? I guess so. The film won't make back the budget plus marketing. In closing the film and what it is makes me sad - this shouldn't be how FFC ends his legendary film career.2.5 / 10.0 stars."
    },
    {
        "ID": "19",
        "Poster": "https://m.media-amazon.com/images/M/MV5BZDkyNjE0NzMtNTgxYS00MDE4LWI0OWYtZGNmNDcxNjRhMTY3XkEyXkFqcGdeQXVyMDM2NDM2MQ@@._V1_UY209_CR0,0,140,209_AL_.jpg",
        "Title": "Late Night with the Devil",
        "Year": "2023",
        "Certificate": "R",
        "Duration (min)": "93",
        "Genre": "Horror",
        "Rating": "7.1",
        "Metascore": "72",
        "Director": "Cameron Cairnes",
        "Cast": "Colin Cairnes, David Dastmalchian, Laura Gordon, Ian Bliss, Fayssal Bazzi",
        "Votes": "43,902",
        "Description": "A live television broadcast in 1977 goes horribly wrong, unleashing evil into the nation's living rooms.",
        "Review Count": "278",
        "Review Title": "When people say they don't make original movies any more",
        "Review": "Late Night with the Devil is a new and unique horror flick. Even having seen 500+ horror films, I can't compare this to anything else. It's not groundbreaking or mind-blowing, but it's different and original.It's also really good, well-made in most aspects. It hooks you early on, even before any of the horror starts. For a while you're just enjoying a fabricated late night TV talk show. And then when the horror kicks in, oh does it kick. There are a few memorable and jaw-dropping scenes.My headline is referring to something that drives me crazy. People, including close friends, complain that Hollywood has run out of ideas and only makes sequels, remakes and superhero movies. I respond by showing them all of the original movies released in a year, and how they did not watch any of them. They only go to the theaters a few times a year, and only for the blockbusters. What they're complaining about is their own fault.If you're a fan of horror and are looking for something far from traditional, Late Night with the Devil is for you. And if you're sick of the perceived lack of original ideas, this is the kind of movie you should be supporting.(1 viewing, 3/31/2024)"
    },
    {
        "ID": "20",
        "Poster": "https://m.media-amazon.com/images/M/MV5BYTdkOTlkNzctNDE2MS00ZTUyLThhZjUtYTdiZGM4MWU3ZjQzXkEyXkFqcGdeQXVyMTM1Njk1MDUx._V1_UY209_CR13,0,140,209_AL_.jpg",
        "Title": "Laapataa Ladies",
        "Year": "2023",
        "Certificate": "",
        "Duration (min)": "122",
        "Genre": "Comedy, Drama",
        "Rating": "8.5",
        "Metascore": "",
        "Director": "Kiran Rao",
        "Cast": "Nitanshi Goel, Pratibha Ranta, Sparsh Srivastav, Savita Malviya",
        "Votes": "20,957",
        "Description": "The misadventures of two young brides who get lost from the same train. From mistaken identities to laugh-out-aloud escapades, the ensuing chaos guarantees laughter galore and heartwarming moments.",
        "Review Count": "209",
        "Review Title": "Movie is not good, avoid it.",
        "Review": "After watching youtubers reviews, many of them gave 4 out of 5, some gave 5 out of 5 also. But kuch tha hi nahi movie me. Just last 30 mnts were nice, rest all pakau.Because today was woman's day so got tickets in Rupees 100, so took risk and went with family but we all got bored, even theater was just 20 % occupied and 80 % was empty though it was Maha Shivratri And Woman's Day still people avoiding this boredom.Just the last 30 minutes was good with a very nice message about woman empowerment.Acting was good by all actors, expected more got very less, hope to see some exciting content from the Team."
    },
    {
        "ID": "21",
        "Poster": "https://m.media-amazon.com/images/M/MV5BOWI2YjAxODctOTAzYi00ZmQ5LWE0ZmEtOGMxMTUzYmVjYzY2XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY209_CR0,0,140,209_AL_.jpg",
        "Title": "Deadpool & Wolverine",
        "Year": "2023",
        "Certificate": "",
        "Duration (min)": "",
        "Genre": "Action, Comedy, Sci-Fi",
        "Rating": "",
        "Metascore": "",
        "Director": "Shawn Levy",
        "Cast": "Ryan Reynolds, Hugh Jackman, Emma Corrin, Morena Baccarin",
        "Votes": "",
        "Description": "Wolverine is recovering from his injuries when he crosses paths with the loudmouth, Deadpool. They team up to defeat a common enemy.",
        "Review Count": "0",
        "Review Title": "",
        "Review": ""
    },
    {
        "ID": "22",
        "Poster": "https://m.media-amazon.com/images/M/MV5BNDNmYTQzMDEtMmY0MS00OTNjLTk4MjItMDZhMzkzOGI3MzA0XkEyXkFqcGdeQXVyNjk5NDA3OTk@._V1_UY209_CR0,0,140,209_AL_.jpg",
        "Title": "War for the Planet of the Apes",
        "Year": "2023",
        "Certificate": "UA",
        "Duration (min)": "140",
        "Genre": "Action, Adventure, Drama",
        "Rating": "7.4",
        "Metascore": "82",
        "Director": "Matt Reeves",
        "Cast": "Andy Serkis, Woody Harrelson, Steve Zahn, Karin Konoval",
        "Votes": "288,425",
        "Description": "After the apes suffer unimaginable losses, Caesar wrestles with his darker instincts and begins his own mythic quest to avenge his kind.",
        "Review Count": "683",
        "Review Title": "Don't understand all the hate.",
        "Review": "Before i saw this movie i looked at some people's opinions about it and i saw mostly negative reviews, so i was really nervous going into this movie thinking that i would have had the same reaction to it and seriously i have no idea what those people are talking about. So War for the planet of the apes is the 3rd film in the new prequel/Reboot of the planet of the apes movies. And this is about Caeser going on a journey to stop a war between his apes and an army of highly trained soldiers, while he also tries to control his more violent instincts. First the obvious, the CGI is amazing and is truly a technological marvel to cinema. Andy Serkis once again plays the ape ruler Caesar and is easily the best movie character in recent years, in each film he has gotten progressively better and in this one it is definitely the best performance. The story is great and is well acted throughout. This movie is also an amazing drama. There are a lot of moments that just make you jerk a tear every once in a while and its believable. The action sequences are pretty good too. Woody Harrelson plays the colonel and he does a pretty good job at it (He is not as good as koba but still good). He is just a character that you can relate to and you understand why he is doing all of this. Caesar and the colonel are pretty relatable. As much as i would love to say how great this movie is, i better stop right here. I loved every part of this movie and i did not find anything i did not like about it, but i am gonna talk about why i think most people were disappointed with this film. So if you watched all the trailers and looked at the title you may be expecting one thing, a ton of apes and humans fighting with guns and rockets. But although there is some of that in this movie, its definitely not the main point of it. This movie to its core is about the war that a person faces emotionally while war is happening around him. We see this concept with Caesar all the way through the movie. It also talks about what terrible things a person or people would do in a war. Woody Harrelson's character does what he does because he believes that the entire human race is going to go extinct if he does not act. I mean, would you do that if you knew that you could slowly be replaced by another species? So some people do not like this film because they were expecting a full on hardcore war movie. And it is that, but it really is a commentary about how a person has a war within themselves when war is happening around them. And people either missed, did not care, or did not understand the more darker themes about this movie. But anyway, in the end i thought this movie was a masterpiece in every way it could have been. It has amazing CGI, performances, action sequences, dark themes, tear jerking moments, and a beautiful moral to it. A+ or 10/10 APES TOGETHER STRONG!"
    },
    {
        "ID": "23",
        "Poster": "https://m.media-amazon.com/images/M/MV5BNzZlODVjMzgtZGM1Yi00MWMwLTkyYTQtMzJlZjQ4MDgwYzg4XkEyXkFqcGdeQXVyMTUzMTg2ODkz._V1_UX140_CR0,0,140,209_AL_.jpg",
        "Title": "Monkey Man",
        "Year": "2023",
        "Certificate": "R",
        "Duration (min)": "121",
        "Genre": "Action, Thriller",
        "Rating": "7",
        "Metascore": "70",
        "Director": "Dev Patel",
        "Cast": "Dev Patel, Sharlto Copley, Pitobash, Jatin Malik",
        "Votes": "41,857",
        "Description": "An anonymous young man unleashes a campaign of vengeance against the corrupt leaders who murdered his mother and continue to systematically victimize the poor and powerless.",
        "Review Count": "330",
        "Review Title": "Great directorial debut",
        "Review": "Got to see an early screening of Monkey Man. I had good expectations going off the trailer and they were met and beyond.The film starts off well and builds momentum for a decent revenge arc although it is hard to follow sometimes. The shakey camera work contributes to this as well as the dialogue not being particularly clear.However what takes this film from good to great is the final third. The music, the action, the violence, it was just so incredibly well done especially for first time director. I couldn't take my eyes off it and didn't know what to expect next.Thank you Jordan peele for saving this from streaming as this deserves to be seen on the big screen!"
    },
    {
        "ID": "24",
        "Poster": "https://m.media-amazon.com/images/M/MV5BYjczYjQ3ZTMtMDAwZi00Y2I2LWE2MTMtOGUyM2YyMThmYTFiXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_UY209_CR8,0,140,209_AL_.jpg",
        "Title": "Shaitaan",
        "Year": "2023",
        "Certificate": "UA",
        "Duration (min)": "132",
        "Genre": "Horror, Thriller",
        "Rating": "6.8",
        "Metascore": "",
        "Director": "Vikas Bahl",
        "Cast": "Ajay Devgn, Madhavan, Jyotika, Janki Bodiwala",
        "Votes": "41,863",
        "Description": "A family's getaway turns terrifying when an intruder possesses the teen daughter's body, putting her at the mercy of his increasingly sinister commands.",
        "Review Count": "1,002",
        "Review Title": "What a waste!",
        "Review": "What a waste of talent, what a waste of time, what a waste of money!The best part of the movie was shown in the trailer. If you have seen it already, congratulations you have watched most of the movie. Watch article 370 twice instead.Direction was great, actors were great, screen play was great, but the movie didn't have any story. It could have been wrapped up in a crime episode.At some places we wished there was a fast forward option to 1.5X. Basically it was a short story which was dragged unnecessarily for 2 hours 12 minutes.I don't have anything to say more, just completing 600 letters :P."
    },
    {
        "ID": "25",
        "Poster": "https://m.media-amazon.com/images/M/MV5BZGYzYjQ3ZWItMGJlZC00YzAxLTgzMTItYzI5MjY2YjA4Mjk5XkEyXkFqcGdeQXVyMDM2NDM2MQ@@._V1_UY209_CR0,0,140,209_AL_.jpg",
        "Title": "Tarot",
        "Year": "2023",
        "Certificate": "PG-13",
        "Duration (min)": "92",
        "Genre": "Horror",
        "Rating": "5",
        "Metascore": "38",
        "Director": "Spenser Cohen",
        "Cast": "Anna Halberg, Avantika, Jacob Batalon, Olwen Fouéré, Harriet Slater",
        "Votes": "3,139",
        "Description": "When a group of friends recklessly violates the sacred rule of Tarot readings, they unknowingly unleash an unspeakable evil trapped within the cursed cards. One by one, they come face to face with fate and end up in a race against death.",
        "Review Count": "77",
        "Review Title": "Easily one of the scariest horror movies I've ever seen",
        "Review": "I went in expecting your average horror film but came out really impressed. Amazing story and direction. The cast was great! Dude from spiderman was awesome! Had some really funny moments which is appreciated in horror, but the scares were what really impressed me! Stuff I haven't seen in other horror films. New concepts which was nice for once. Kept thinking about the movie after watching it which is what a good movie does. All around the special fx and cinematography were amazing. I would recommend this to anyone that loves horror. I can see this being a horror fan Favorite and would definitely watch again!"
    },
    {
        "ID": "26",
        "Poster": "https://m.media-amazon.com/images/M/MV5BY2QwOGE2NGQtMWQwNi00M2IzLThlNWItYWMzNGQ5YWNiZDA4XkEyXkFqcGdeQXVyNTE1NjY5Mg@@._V1_UX140_CR0,0,140,209_AL_.jpg",
        "Title": "Godzilla x Kong: The New Empire",
        "Year": "2023",
        "Certificate": "PG-13",
        "Duration (min)": "115",
        "Genre": "Action, Adventure, Fantasy",
        "Rating": "6.4",
        "Metascore": "47",
        "Director": "Adam Wingard",
        "Cast": "Rebecca Hall, Brian Tyree Henry, Dan Stevens, Kaylee Hottle",
        "Votes": "50,012",
        "Description": "Two ancient titans, Godzilla and Kong, clash in an epic battle as humans unravel their intertwined origins and connection to Skull Island's mysteries.",
        "Review Count": "402",
        "Review Title": "The plot stinks worse than Kong poo.",
        "Review": "When asked what his plan is, a character in Godzilla x Kong: The New Empire says 'throw everything at the wall and see what sticks'. Director Adam Wingard has adopted this approach when making this film, but on this occasion very little that is being randomly tossed about actually sticks. The smackdowns between the film's creatures are loud, frantic and reasonably fun, but the plot is a sloppy turd of Titan proportions -- a stinky, contrived, overblown mess brought to life in a maelstrom of not very convincing CGI.The script is absolutely terrible, and the majority of the film had me either scratching my head in confusion or laughing at its preposterousness. Kong being equipped with a metal fist is an undeniably cool idea, but the fact that the protagonists just happen to have such a device on hand in Hollow Earth is just crazy (especially one with built in anti-frostbite serum!). A vet who knows how to extract a Kong tooth also knows how to fly a Hollow Earth hover ship -- clearly a man of many talents. God only knows what the Iwi tribe were up to with their glowing pyramids. What was the deal with that glowing spike that nasty ape used to control the ice lizard? And why did everyone suddenly start floating around in Hollow Earth? (there might have been explanations for some of these points, but they became lost in all of the chaos).After Godzilla Minus One, I suggest leaving all future films featuring the big lizard to the Japanese.3.5/10, rounded down to 3 for Kaylee Hottle's perpetually anxious look -- doesn't the girl have any other expressions?"
    },
    {
        "ID": "27",
        "Poster": "https://m.media-amazon.com/images/M/MV5BNGIyYWMzNjktNDE3MC00YWQyLWEyMmEtN2ZmNzZhZDk3NGJlXkEyXkFqcGdeQXVyMTUzMTg2ODkz._V1_UY209_CR0,0,140,209_AL_.jpg",
        "Title": "Poor Things",
        "Year": "2023",
        "Certificate": "R",
        "Duration (min)": "141",
        "Genre": "Comedy, Drama, Romance",
        "Rating": "7.9",
        "Metascore": "88",
        "Director": "Yorgos Lanthimos",
        "Cast": "Emma Stone, Mark Ruffalo, Willem Dafoe, Ramy Youssef",
        "Votes": "260,730",
        "Description": "An account of the fantastical evolution of Bella Baxter, a young woman brought back to life by the brilliant and unorthodox scientist Dr. Godwin Baxter.",
        "Review Count": "1,073",
        "Review Title": "Not for me",
        "Review": "Poor Things simply just wasn't for me. I really don't like to say I hate a movie... so we'll just go with \"it wasn't for me\". I did appreciate the production design and performances, but a lot of the cinematography and writing/directing choices just didn't work for me. Just a little too weird for my tastes. And felt way too long. I wanted to like it so bad, and was so disappointed to find myself disliking it so much.I know it's been getting good reviews from most people - I'm in the minority here! So if you're interested, definitely check it out! I'm a huge supporter of going to see a film if you are interested in it and deciding for yourself how you feel!"
    },
    {
        "ID": "28",
        "Poster": "https://m.media-amazon.com/images/M/MV5BMDI1ZTc1MDAtYWY3Mi00OWM5LWFkZTUtMWM1Yjc1ZjFiOWYzXkEyXkFqcGdeQXVyMTUzMTg2ODkz._V1_UY209_CR0,0,140,209_AL_.jpg",
        "Title": "Arcadian",
        "Year": "2023",
        "Certificate": "R",
        "Duration (min)": "92",
        "Genre": "Action, Horror, Thriller",
        "Rating": "5.5",
        "Metascore": "60",
        "Director": "Benjamin Brewer",
        "Cast": "Nicolas Cage, Jaeden Martell, Maxwell Jenkins, Sadie Soverall",
        "Votes": "6,989",
        "Description": "A father and his twin teenage sons fight to survive in a remote farmhouse at the end of the end of the world.",
        "Review Count": "61",
        "Review Title": "There is no mode - \"stabilization\"",
        "Review": "The story of a father and two teenagers in a post-apocalyptic world inhabited by bloodthirsty creatures. The first thing that cannot be agreed with is that Nicolas Cage has not aged in 15 years, probably the atmosphere of the post-apocalypse has influenced him so much. Secondly, it's a twitching camera, it's like shaking the screen in a movie theater - a nightmare for epileptics. Thirdly, the operator does not know what a mise en scene or composition is at all - there is nothing beautiful in camerawork, there is nothing for the eye to cling to. Fourthly, it is very boring. Watching this is like standing in line for an appointment with a therapist: it's unbearable, and I want it all to end as soon as possible. I couldn't watch it to the end, it's beyond me."
    },
    {
        "ID": "29",
        "Poster": "https://m.media-amazon.com/images/M/MV5BMDU2ZmM2OTYtNzIxYy00NjM5LTliNGQtN2JmOWQzYTBmZWUzXkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_UY209_CR0,0,140,209_AL_.jpg",
        "Title": "Bullet Train",
        "Year": "2023",
        "Certificate": "A",
        "Duration (min)": "127",
        "Genre": "Action, Comedy, Thriller",
        "Rating": "7.3",
        "Metascore": "49",
        "Director": "David Leitch",
        "Cast": "Brad Pitt, Joey King, Aaron Taylor-Johnson, Brian Tyree Henry",
        "Votes": "433,085",
        "Description": "Five assassins aboard a swiftly-moving bullet train find out that their missions have something in common.",
        "Review Count": "1,580",
        "Review Title": "I had so much fun wacthing this",
        "Review": "Rare seeing Brad Pitt in a movie like this but from what I understand the director is a good friend of his. It's an action movie the reads like Smoking Aces. An ensemble cast with a few different stories in it, of which, interestingly enough Brad Pitt's story as a man named Ladybug could be considered just as important as the others despite being the star.Unlike Smoking Aces, the Bullet Train in itself is a character and a very expensive one that makes it a blockbuster. On top of that the very cool Celebrity Cameos that prove this director makes friends with everyone he works with in Hollywood.The Japanese back drop was cool not just because I'm an anime fan but because it made the film and the bullet train visual amazing to look at, but Hollywood needs more Japanese actors who can speak English. Hiroyuki Sanada is become the Danny Trejo of the Far East.Its action packed and its humorous everything I want when watching a movie in theatres."
    },
    {
        "ID": "30",
        "Poster": "https://m.media-amazon.com/images/M/MV5BYTRhNjcwNWQtMGJmMi00NmQyLWE2YzItODVmMTdjNWI0ZDA2XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_UX140_CR0,0,140,209_AL_.jpg",
        "Title": "Star Wars: Episode I - The Phantom Menace",
        "Year": "2023",
        "Certificate": "UA",
        "Duration (min)": "136",
        "Genre": "Action, Adventure, Fantasy",
        "Rating": "6.5",
        "Metascore": "51",
        "Director": "George Lucas",
        "Cast": "Ewan McGregor, Liam Neeson, Natalie Portman, Jake Lloyd",
        "Votes": "859,444",
        "Description": "Two Jedi escape a hostile blockade to find allies and come across a young boy who may bring balance to the Force, but the long dormant Sith resurface to claim their original glory.",
        "Review Count": "3,590",
        "Review Title": "A perspective after all the hype has died down",
        "Review": "Lucas may have problems as a director and writer, but I've always thought that those flaws are balanced by his great storytelling ability. The problem with \"The Phantom Menace\" is that he simply has no story to tell. The film merely adds an introductory chapter to a story that has already been told, and stretches it out into a two-hour movie. It is no accident that prequels of this kind are rare. They are very difficult to make properly. And apparently he's just not a sophisticated enough filmmaker to pull it off.For one thing, this project is limited by the fact that anyone familiar with the first trilogy knows the story's outcome, and it therefore lacks some of the suspense associated with a gradually unfolding saga. More importantly, however, this situation leaves Lucas with very little freedom as a storyteller. It also encourages him to gloss over key events; because their outcome is a foregone conclusion, he forgets to bring them to life.For example, we know there will eventually be a romance between Anakin and Padme. So Lucas has the two characters meet here and--surprise, surprise--they seem to like each other. Their developing friendship isn't portrayed that clearly, and their motivations for becoming close aren't explained. Because Lucas fails to make scenes like these believable, we can't help being conscious of how he's manipulating the plot in his effort to connect the two trilogies. Another good example of this problem is Anakin's portrayal as a potential Jedi. There doesn't appear to be anything about this kid remotely out of the ordinary, even though the other characters keep talking like there is. Our only reason for thinking he's special is that the plot requires it.If the story fails to be engaging, it is because we never see the important events. Lucas makes a fatal error in not showing what's happening on Naboo, the small planet whose capture is the focus of the plot. Numerous atrocities are supposedly being committed against the planet's inhabitants, but we only know about this because the characters on screen refer to the events, usually rather woodenly.The deadpan performances are a problem in themselves, but they only highlight our lack of involvement in the story. Think of Han Solo sweating in fear, then think of the emotional vacuums passing for characters in this film. Whenever any of the characters do express emotion, as in the scene where Anakin and his mom part, it still seems awfully restrained. Somehow, Lucas manages to keep the emotional reactions of his characters to a minimum, which gives the film an almost mechanical feel.It's true that \"A New Hope\" never showed Alderaan's inhabitants, but we still could feel the tragedy of the planet's destruction through the horrified reactions of Princess Leia and Obi Wan. Moreover, there were many other involving events which we witnessed directly, such as the slaying of rebels at the beginning; the capture and torture of the princess; and the murder of Luke's foster parents. Furthermore, the major plot elements were intriguing in and of themselves. They weren't there merely to show us how they were to be linked to later events, which seems to be the case with the new film.I suspect that Lucas was not as concerned in the first trilogy with what had to happen later in the story and was therefore able to focus his attention on the events at hand. The weakest segment was \"Return of the Jedi,\" which had the task of bringing the story to an end. Only then did Lucas start to show signs of forcing plot points. In \"The Phantom Menace,\" he gets so bogged down in the task of bringing his story from point A to point B that he ends up with only the bare bones of a plot, and none of it comes alive.This is especially true of the characterization. In the old trilogy, characters like Yoda and Han reveal distinct personalities in their first few minutes on screen. This film goes for more than two hours and the characters, including the familiar ones, come off vague and nondescript. We aren't given much of a chance to experience their personalities in the way they interact. We must take Qui Gon's word for it when he describes Obi Wan as \"headstrong.\" What's most odd is that the cartoons seem better developed than the humans. The scenes where Qui Gon negotiates with the birdlike slave-owner Watto are amusing and well-done--probably the movie's best scenes aside from the stunning action sequences--but they can't hold a candle to the constant interactions throughout the first trilogy.One thing I cannot do is accuse the film of lacking creativity. The design of the creatures, the technologies, and the planets is impressive. Watching the film is sort of like reading a children's book that isn't very good but abounds with beautiful illustrations. There is certainly a \"wow\" factor in the movie's visuals, but the effect of it is short-lived.I get irked when I hear fans talk as though the \"Star Wars\" movies were never about anything beyond special effects. While the inventive visuals are part of what made the originals so revolutionary, they're not what made the films so fun to watch. And in no way can they explain the trilogy's continuing popularity today. After all, many of the original effects look primitive by today's standards, and their novelty has certainly worn off. Only an enduring and compelling storyline could have allowed the first three films to become the classics they're almost universally acknowledged to be."
    },
    {
        "ID": "31",
        "Poster": "https://m.media-amazon.com/images/M/MV5BZDMwZTlhZGEtNTRkZi00YjI5LTliMDctN2UzZWJkZjk5NmJjXkEyXkFqcGdeQXVyOTc0NjQzOTM@._V1_UY209_CR0,0,140,209_AL_.jpg",
        "Title": "Turtles All the Way Down",
        "Year": "2023",
        "Certificate": "PG-13",
        "Duration (min)": "111",
        "Genre": "Drama, Romance",
        "Rating": "6.7",
        "Metascore": "64",
        "Director": "Hannah Marks",
        "Cast": "Isabela Merced, Cree, Judy Reyes, Felix Mallard",
        "Votes": "2,491",
        "Description": "A teenager with OCD tries to solve a mystery surrounding a fugitive billionaire.",
        "Review Count": "17",
        "Review Title": "Not horrible, not great",
        "Review": "Despite the film not staggering our eyes with extraordinarily amazing cinematography or oscar-worthy acting performances, it manages to showcase passable performances and some not half-bad shots.Unfortunately the movie itself struggles to engage its audience due to a lackluster plot. It fails to deliver a compelling story, leaving many unanswered questions lingering.What stood out for me was the disproportionate focus on Davis and his family. It gives the impression of inflated importance, detracting from the broader narrative.Also I hated the ending.Overall the movie is a mediocre effort that may entertain momentarily, but ultimately fails to leave a lasting impression."
    },
    {
        "ID": "32",
        "Poster": "https://m.media-amazon.com/images/M/MV5BYzE3ZmNlZTctMDdmNy00MjMzLWFmZmYtN2M5N2YyYTQ1ZDJjXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_UY209_CR0,0,140,209_AL_.jpg",
        "Title": "Rise of the Planet of the Apes",
        "Year": "2023",
        "Certificate": "UA",
        "Duration (min)": "105",
        "Genre": "Action, Drama, Sci-Fi",
        "Rating": "7.6",
        "Metascore": "68",
        "Director": "Rupert Wyatt",
        "Cast": "James Franco, Andy Serkis, Freida Pinto, Karin Konoval",
        "Votes": "565,131",
        "Description": "A substance designed to help the brain repair itself gives advanced intelligence to a chimpanzee who leads an ape uprising.",
        "Review Count": "527",
        "Review Title": "Hands down, the best summer movie of 2011",
        "Review": "Of all the movies that can possibly be re-booted......why reboot another movie that's already been re-booted? And of all the projects that the Weta team can possibly tackle, why this one? Well it must be the script, because everyone that's come across it has wanted to be somewhat involved. Hopefully it lives up to the expectations that are already in place, because i don't think i could handle another stink bomb like Burton's version.Finally......a summer movie that's actually WORTH your summer dollar. Almost every element of this film is pitch perfect. Just what makes this 'oh so' great? Allow me to explain....Judging from the preview, i thought the movie to be a little too relative to the concept from \"Deep Blue Sea\". But this movie takes a much more different route with their Alzheimer's approach. Needless to say, they did a much better job than that movie.....obviously.I know most people may be scratching their heads to this comment, but in my opinion, this is easily the most well written script of the year thus far. It's intelligent, thought provoking, emotional, and damn well entertaining. What makes this so good is the progression of the main ape 'Ceaser' (heh, ironic name), and his journey from a curious and smart ape, into an upset ape that realizes the harsh realities of being treated like an animal. It's now easy to see just why everyone jumped on board when they read this. I kid you not, i actually got goosebumps from this movie, and that rarely happens.And once again, the Weta team did a phenomenal job with their brilliant special effects. Andy Serkis who has already done work like this before in 'Lord of Rings' and 'King Kong', out preformed most actors in Hollywood without barely saying a word. Is it wrong to say that a man in a blue suit with dots all over him, imitating an ape is so far the best actor i've seen this year? Uh.....not at all. Trust me, see the movie, and you'll understand why.Bottom Line.......not only is this easily the best movie of the summer, i will go as far as saying it's the best movie i have seen so far this year. Yes, it is THAT good. Like i said earlier, almost every element of this movie is pitch perfect. The writing, the acting, the special effects.....all done to near perfection. It some people's eyes, this is called a reboot. However, it feels more like a prequel. But judging from what i just saw, i hope to god that they make more of these, because it literally just blew my mind."
    },
    {
        "ID": "33",
        "Poster": "https://m.media-amazon.com/images/M/MV5BMDBmYTZjNjUtN2M1MS00MTQ2LTk2ODgtNzc2M2QyZGE5NTVjXkEyXkFqcGdeQXVyNzAwMjU2MTY@._V1_UY209_CR0,0,140,209_AL_.jpg",
        "Title": "Oppenheimer",
        "Year": "2023",
        "Certificate": "R",
        "Duration (min)": "180",
        "Genre": "Biography, Drama, History",
        "Rating": "8.3",
        "Metascore": "90",
        "Director": "Christopher Nolan",
        "Cast": "Cillian Murphy, Emily Blunt, Matt Damon, Robert Downey Jr.",
        "Votes": "738,405",
        "Description": "The story of American scientistJ. Robert Oppenheimerand his role in the development of the atomic bomb.",
        "Review Count": "3,369",
        "Review Title": "Murphy is exceptional",
        "Review": "You'll have to have your wits about you and your brain fully switched on watching Oppenheimer as it could easily get away from a nonattentive viewer. This is intelligent filmmaking which shows it's audience great respect. It fires dialogue packed with information at a relentless pace and jumps to very different times in Oppenheimer's life continuously through it's 3 hour runtime. There are visual clues to guide the viewer through these times but again you'll have to get to grips with these quite quickly. This relentlessness helps to express the urgency with which the US attacked it's chase for the atomic bomb before Germany could do the same. An absolute career best performance from (the consistenly brilliant) Cillian Murphy anchors the film. This is a nailed on Oscar performance. In fact the whole cast are fantastic (apart maybe for the sometimes overwrought Emily Blunt performance). RDJ is also particularly brilliant in a return to proper acting after his decade or so of calling it in. The screenplay is dense and layered (I'd say it was a thick as a Bible), cinematography is quite stark and spare for the most part but imbued with rich, lucious colour in moments (especially scenes with Florence Pugh), the score is beautiful at times but mostly anxious and oppressive, adding to the relentless pacing. The 3 hour runtime flies by. All in all I found it an intense, taxing but highly rewarding watch. This is film making at it finest. A really great watch."
    },
    {
        "ID": "34",
        "Poster": "https://m.media-amazon.com/images/M/MV5BY2RlMDhlY2MtMjQ1Zi00NzI5LTgxOTgtZjliNWMzYTY3NWZkL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_UX140_CR0,0,140,209_AL_.jpg",
        "Title": "Planet of the Apes",
        "Year": "2023",
        "Certificate": "UA",
        "Duration (min)": "120",
        "Genre": "Action, Adventure, Sci-Fi",
        "Rating": "5.7",
        "Metascore": "50",
        "Director": "Tim Burton",
        "Cast": "Mark Wahlberg, Helena Bonham Carter, Tim Roth, Michael Clarke Duncan",
        "Votes": "230,536",
        "Description": "In 2029, an Air Force astronaut crash-lands on a mysterious planet where evolved, talking apes dominate a race of primitive humans.",
        "Review Count": "1,178",
        "Review Title": "Planet of Shallowness",
        "Review": "Thank you Hollywood. Yet another movie classic utterly ruined by a cheap, shallow, effect-heavy and redundant remake. The original \"Planet of the Apes\" was an intelligent and thought-provoking movie with a very clear message. It was a movie that focused almost entirely on dialogue, which sounds very dull but was in fact very interesting. This movie, on the other hand, seems to have done away with pretty much ALL the dialogues. Instead of a great movie we get an incredibly stupid two hour chase movie. Dialogue has been reduced to a mere minimum, character interaction and development are non-existent and most of the time it's extremely hard to figure out what's going on. Instead, we get a bunch of pointless action scenes, some marginally funny one-liners and some very hollow quasi-intelligent conversations. The only thing worth mentioning about this movie is that it looks absolutely fantastic. The make-up of the apes is magnificent, and the sets and backgrounds are beautiful too. However, this does not distract from the fact that \"Planet of the Apes (2001)\" is a very shallow and simplistic movie, filled with paper-thin characters, stupid dialogue and a nearly non-existent plot. Please Hollywood, stop ruining great movies by turning them into senseless blockbusters.Oh yeah, the ending did not make ANY SENSE WHATSOEVER.\n* out of **** stars, mainly for the visuals"
    },
    {
        "ID": "35",
        "Poster": "https://m.media-amazon.com/images/M/MV5BYWE2MzU2ZGUtYTY1Yi00ZTI5LWE4NzMtNWM1NzRhMDQ3ZjM3XkEyXkFqcGdeQXVyNjc5NjEzNA@@._V1_UY209_CR0,0,140,209_AL_.jpg",
        "Title": "Dawn of the Planet of the Apes",
        "Year": "2023",
        "Certificate": "UA",
        "Duration (min)": "130",
        "Genre": "Action, Adventure, Drama",
        "Rating": "7.6",
        "Metascore": "79",
        "Director": "Matt Reeves",
        "Cast": "Gary Oldman, Keri Russell, Andy Serkis, Kodi Smit-McPhee",
        "Votes": "474,347",
        "Description": "The fragile peace between apes and humans is threatened as mistrust and betrayal threaten to plunge both tribes into a war for dominance over the Earth.",
        "Review Count": "534",
        "Review Title": "Intelligent and thrilling storytelling with amazing CGI – Science-Fiction of the best possible kind",
        "Review": "Among Hollywood's recent output of mediocre (and in some cases: downright abysmal) remakes of Sci-Fi classics, 'Rise of the Planet of the Apes' was the rare movie which stood out, for it had as much of a brain as it had a heart – plus an original approach to the well-known material and great visuals. Having said that, 'Rise' practically pales in comparison to Matt Reeves' sequel: the upcoming 'Dawn of the Planet of the Apes' is as close to a Science-Fiction masterpiece as a 170 million PG-13 Hollywood summer blockbuster can possibly get.The storyline picks up ten years after we saw Ceasar and his fellow simian escapees seek refuge in the woods near San Francisco, and although the film's trailers already gave away pretty much everything that happened during that time (and alas, way too much of what will happen), I'm not going to spoil anything for those who carefully avoided watching said trailers. As with all my reviews, instead of giving away any details about the story, I'll elaborate on all other aspects of the movie.What needs to be mentioned first is what an astonishing achievement 'Dawn' is when it comes to the use of CGI. I'm normally very critical towards the (over-)use of CGI – but the level of craftsmanship displayed here simply has to be admired. It only took me seconds to forget I was watching digital characters (brought to life through the outstanding motion-capture performances by Andy Serkis, Toby Kebbell and Judy Grier – to name but a few), and I can't begin to imagine what a task it must have been for the artists and wizards in the animation department to work on every background and every tiny little detail of every character until this level of seamlessness and reality could be achieved.But nearly every other aspect of the movie has been realized equally well: Michael Giacchino's haunting musical score fits and reflects the drama on screen perfectly, while the – often terrifying – beauty of the images on screen had me immediately wondering who the DoP was (now I know: Michael Seresin, the genius veteran DoP of such classics as 'Midnight Express' and 'Angel Heart'). When it comes to the action; well, 'Dawn' is not your usual summer blockbuster. This is no light-hearted, comic-book-style fantasy film with fun, over-the-top action scenes. What we have here is a gritty, realistic portrayal of a slowly escalating conflict, and when we do get to the battle scenes in the third act, those scenes are a spectacular, mesmerizing visual feast (and ultimately heart breaking).But the core of this film – and also the reason why the action scenes in the third act really do have an impact and all the mayhem really gets to you – is the intelligent, skilfully told story with its well-drawn, believable characters (portrayed by equally believable actors). The tragic simian/human conflict mirrors our real – and very human – past and present day wars and social frictions in a very credible way and thus makes this film resonate far beyond what any mere Sci-Fi premise would let you expect. So my verdict: With its beautiful imagery, highly relevant story and breath-taking effects, 'Dawn of the Planet of the Apes' is as close to a Science-Fiction masterpiece as its mass-audience orientated constrictions allowed it to be (which – in this case – is very close); an astonishing achievement and highly recommended. 9 stars out of 10.Favorite Films: http://www.imdb.com/list/ls054200841/"
    },
    {
        "ID": "36",
        "Poster": "https://m.media-amazon.com/images/M/MV5BOGE5NjllZTEtMGJjNy00ZTFmLThlNDItNmNiZTgyOTQ4OTA2XkEyXkFqcGdeQXVyMTUzMTg2ODkz._V1_UY209_CR0,0,140,209_AL_.jpg",
        "Title": "The Iron Claw",
        "Year": "2023",
        "Certificate": "A",
        "Duration (min)": "132",
        "Genre": "Biography, Drama, Sport",
        "Rating": "7.7",
        "Metascore": "73",
        "Director": "Sean Durkin",
        "Cast": "Zac Efron, Jeremy Allen White, Harris Dickinson, Maura Tierney",
        "Votes": "62,061",
        "Description": "The true story of the inseparable Von Erich brothers, who made history in the intensely competitive world of professional wrestling in the early 1980s.",
        "Review Count": "239",
        "Review Title": "Solid 10",
        "Review": "I cannot begin to describe how accurate Zac's portrayal of Kevin is. I knew the brothers in the early 80's. This is a heart wrenching account that delivers every high and low of their lives.The performances are nuanced, with an unexpected depth. This is not a feel good movie. The ending is actually the beginning and that is beautiful. Lily James is stupendous and mesmerizing as Pam, and I simply cannot express my awe of Zac's performance. He deserves an Oscar.Just know that this story is as close to a documentary as it can possibly be. It was beautiful seeing the actual footage from various match ups. Thank you for making this."
    }
]